In [1]:
import pandas as pd

new_list = ["apple", "baby", "cot", "dog", "elephant"]

series = pd.Series(new_list)

print(series)
print(series.dtype)

0       apple
1        baby
2         cot
3         dog
4    elephant
dtype: object

In [8]:
dict_list = [
    {
        "name": "Margaret",
        "age": 10,
        "female": True
    },
    {
        "name": "Sharon",
        "age": 12,
        "female": True
    },
    {
        "name": "Dietrich",
        "age": 14,
        "female": False
    }
]

import pandas as pd

data = pd.DataFrame(dict_list)
# print(data)
# print(data.dtypes)
print(data.T)
print(data.loc[1]["age"])
print(data.loc[2])
data["name"]

               0       1         2
name    Margaret  Sharon  Dietrich
age           10      12        14
female      True    True     False
12
name      Dietrich
age             14
female       False
Name: 2, dtype: object

0    Margaret
1      Sharon
2    Dietrich
Name: name, dtype: object

In [30]:

dict_list = [
    {
        "name": "Margaret",
        "age": 10,
        "female": True
    },
    {
        "name": "Shubert",
        "age": 11,
        "female": False
    },
    {
        "name": "Solomon",
        "age": 19,
        "female": False
    },
    {
        "name": "Sharon",
        "age": 12,
        "female": True
    },
    {
        "name": "Dietrich",
        "age": 14,
        "female": False
    }
]

import pandas as pd

data = pd.DataFrame(dict_list, index=["team1", "team1", "team2", "team3", "team3"])

# print(data)
# print(data.dtypes)
data.head()
team3 = data.loc["team3"]
# print(team3)

# print(team3.dtypes)


team3_names = team3.loc[:, ["name", "age"]]
print(team3_names)
# print(team3_names.dtype)


print(data["name"])

team3_ages = team3["age"]
print(team3_ages)
print(team3_ages.dtype)

           name  age  female
team1  Margaret   10    True
team1   Shubert   11   False
team2   Solomon   19   False
team3    Sharon   12    True
team3  Dietrich   14   False
           name  age
team3    Sharon   12
team3  Dietrich   14
team1    Margaret
team1     Shubert
team2     Solomon
team3      Sharon
team3    Dietrich
Name: name, dtype: object
team3    12
team3    14
Name: age, dtype: int64
int64

In [50]:
print(data)
new_data = data.copy()
some_data = new_data.append(pd.Series({"name": "Delilah", "age": 14, "female": True}, name="team2"))
print(some_data)

           name  age  female
team1  Margaret   10    True
team1   Shubert   11   False
team2      Orca   20    True
team3    Sharon   12    True
team3  Dietrich   14   False
           name  age  female
team1  Margaret   10    True
team1   Shubert   11   False
team2      Orca   20    True
team3    Sharon   12    True
team3  Dietrich   14   False
team2   Delilah   14    True

In [53]:
# reduced = some_data.drop()
# print(reduced)
print(new_data)

           name  age  female
team1  Margaret   10    True
team1   Shubert   11   False
team2      Orca   20    True
team3    Sharon   12    True
team3  Dietrich   14   False

In [73]:
import pandas as pd

# with open("C:/Users/peich/OneDrive/Documents/SetForLife.csv", "r") as file:
#     line = file.readline()
#     print(line)
csv = pd.read_csv("C:/Users/peich/OneDrive/Documents/SetForLife.csv")
# print(type(csv))
# csv.head()
print(csv.columns)
new_csv = csv.rename(columns={" Draw Date (yyyymmdd)": "Draw Date"})
new_csv.head()

Index(['Draw Number', ' Draw Date (yyyymmdd)', ' Winning Number 1', '2', '3',
       '4', '5', '6', '7', '8', 'Bonus 1', ' Bonus 2',
       ' Set for Life 1st Prize', '2nd Prize', ' 3rd Prize', ' 4th Prize',
       ' 5th Prize', ' 6th Prize', ' 7th Prize', ' 8th Prize'],
      dtype='object')

,Draw Number,Draw Date,Winning Number 1,2,3,4,5,6,7,8,Bonus 1,Bonus 2,Set for Life 1st Prize,2nd Prize,3rd Prize,4th Prize,5th Prize,6th Prize,7th Prize,8th Prize
0,1,20150807,8,10,9,5,30,4,19,12,29,6,$0.00,$0.00,$947.70,$83.45,$22.95,$17.40,$12.45,$9.35
1,2,20150808,13,7,25,21,12,36,6,26,14,35,$0.00,"$3,689.80",$885.35,$117.55,$29.70,$20.75,$13.20,$10.30
2,3,20150809,7,3,23,11,31,15,4,27,37,36,Set for Life,"$7,713.95",$411.35,$84.95,$26.40,$17.30,$12.75,$9.45
3,4,20150810,30,24,28,9,14,7,8,19,32,23,$0.00,$0.00,"$1,217.75",$105.95,$24.85,$19.45,$13.00,$9.90
4,5,20150811,18,21,35,27,3,9,19,15,31,7,$0.00,"$9,675.30",$488.75,$112.55,$26.15,$18.45,$13.25,$9.60

In [75]:
print("Count: {}".format(csv.count()))
print(f"size: {csv.size}")

14560